[
  {
    "id": 3,
    "date": "2026-01-15T00:00:00.000Z",
    "title": "Pre-order of TSUF materials",
    "content": "<p><strong>Important:</strong> Pre-order of The Truth Sets Us Free materials</p>\n<p>As part of the inaugural event of The Truth Sets Us Free, we have prepared vests, messenger bags, hats, and other materials for purchase. The clothing will be especially important since we will not have tables and banners and will be going out based on our First Amendment rights to speak to people and pass out Bibles and ministry books.</p>\n<p>The messenger bags make it easier to pass things out compared to keeping everything in a backpack. Our hope is that these items will be used again and often this entire year. All the materials are available for pre-order at:</p>\n<p><a href=\"https://materials.bfa.org/collections/the-truth-sets-us-free\">https://materials.bfa.org/collections/the-truth-sets-us-free</a></p>\n<p>Priority will be given to the saints who plan on joining the gospel trip after the conference. You will need to create an account if you have not already, and there is an approval process which will be expedited for the conference. The orders will be fulfilled right before or after Meeting 2 of the conference, and unsold materials will be made available to all saints at that time.</p>\n",
    "type": "important",
    "slug": "2026-01-15-tsuf-materials"
  },
  {
    "id": 4,
    "date": "2026-01-13T00:00:00.000Z",
    "title": "Schedule Update",
    "content": "<p>The MLK Parade Truth Sets Us Free coordination meeting time is now Lord&#39;s Day 7:30 PM.</p>\n",
    "type": "update",
    "slug": "2026-01-16-schedule-update"
  },
  {
    "id": 2,
    "date": "2026-01-11T00:00:00.000Z",
    "title": "Hotel Room Commitment",
    "content": "<p><strong>Important:</strong> We have a contracted minimum number of rooms with the hotel. If we don&#39;t fill these rooms, we will face financial penalties.</p>\n<h2>If You Need to Cancel</h2>\n<p>If circumstances change and you cannot attend:</p>\n<ol>\n<li><strong>First</strong>, try to find someone else who can take your room</li>\n<li><strong>If that&#39;s not possible</strong>, email us at <a href=\"mailto:info@carolinasblendingconference.org\">info@carolinasblendingconference.org</a> with your cancellation request</li>\n<li>We will add your room to the waitlist and offer it to others who need accommodation</li>\n</ol>\n<p>Your cooperation helps us avoid penalties. Thank you!</p>\n",
    "type": "important",
    "slug": "2026-01-09-hotel-room-commitment"
  },
  {
    "id": 1,
    "date": "2026-01-11T00:00:00.000Z",
    "title": "Schedule Update",
    "content": "<p>The MLK Parade Truth Sets Us Free coordination meeting time is now TBD. Please check back for updates.</p>\n",
    "type": "update",
    "slug": "2026-01-11-schedule-update"
  }
]